{
  "projects": [
    {
      "id": 1,
      "title": "WorkMatch",
      "image": "workmatch",
      "description": "Collaboratively developed a mobile application with React Native designed to facilitate connections between employers and job seekers.",
      "key_contributions": [
        "Developed custom hooks to:",
        "Collect and send user registration data to the database.",
        "Validate login credentials by retrieving and verifying data from the database.",
        "Retrieve and display user information across various app screens."
      ],
      "category": "mobile",
      "modality": "team",
      "technologies": [
        {
          "image": "react"
        },
        {
          "image": "typescript"
        },
        {
          "image": "supabase"
        }
      ],
      "github_link": "https://github.com/BrightCoders-Institute/s8pf-bcdic23-rn-proyecto-final-team02"
    },
    {
      "id": 2,
      "title": "Portfolio",
      "image": "portfolio",
      "description": "Created a personal portfolio website to showcase my projects, dynamically rendering content using HTML, CSS, and JavaScript without relying on a database.",
      "key_contributions": [
        "Implemented dynamic project rendering by fetching data from a manually created JSON file.",
        "Structured the site with clean, maintainable code, focusing on user experience and accessibility."
      ],
      "category": "web",
      "modality": "personal",
      "technologies": [
        {
          "image": "html"
        },
        {
          "image": "css"
        },
        {
          "image": "javascript"
        }
      ],
      "github_link": "https://github.com/FelixAva/Portfolio"
    },
    {
      "id": 3,
      "title": "Calculator",
      "image": "calculator",
      "description": "Mobile calculator application capable of performing essential arithmetic operations such as addition, subtraction, multiplication, and division.",
      "key_contributions": [
        "Develop the core functionality to handle basic arithmetic operations.",
        "Managed application state using custom hooks, ensuring smooth operation and clean code structure.",
        "Ensured smooth performance and compatibility across both Android and iOS platform."
      ],
      "category": "mobile",
      "modality": "personal",
      "technologies": [
        {
          "image": "react"
        },
        {
          "image": "typescript"
        }
      ],
      "github_link": "https://github.com/FelixAva/react-native-calculator"
    },
    {
      "id": 4,
      "title": "AuthenticationApp",
      "image": "calculator",
      "description": "Developed a mobile application using React Native that consumes endpoints from an external API to manage user authentication and session handling.",
      "key_contributions": [
        "Integrated Axios to handle API requests for user registration and login.",
        "Utilized React Hook Forms for input validation.",
        "Managed user sessions and token storage using Zustand, ensuring seamless session persistence."
      ],
      "category": "mobile",
      "modality": "personal",
      "technologies": [
        {
          "image": "react"
        },
        {
          "image": "typescript"
        }
      ],
      "github_link": "https://github.com/FelixAva/authentication-app"
    }
  ]
}
